system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2.3.0                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (-1.8 -5 -0.5) //0 bottom rectangle 
    (1.8 -5 -0.5)  //1
    (1.8 5 -0.5)  //2
    (-1.8 5 -0.5)   //3

    (-1.8 -5 0.5)  //4
    (1.8 -5 0.5)   //5
    (1.8 5 0.5)   //6
    (-1.8 5 0.5)    //7
);

blocks
(
 hex (0 1 2 3 4 5 6 7) (72 200 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    sides
    {
	type symmetry;
	faces
	(
	    (5 1 2 6)
	    (0 4 7 3)
	);
    }
    ends
    {
	type wall;
	faces
	(
	    (0 1 5 4)
	    (2 3 7 6)
	);
    }
 );

mergePatchPairs
(
);

// ************************************************************************* //
