constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          28800;
        startFace       28528;
    }
    sides
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          400;
        startFace       57328;
    }
    ends
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          144;
        startFace       57728;
    }
)

// ************************************************************************* //
